In [1]:
import pandas as pd
import psycopg2

In [2]:
def peek_at_table(connection, table, n_rows=10, schema='public'):
    sql = '''
    select * from {schema}."{table}" limit {n_rows}
    '''.format(schema=schema, table=table, n_rows=n_rows)
    df = query_database(connection, sql)
    return df

def query_database(connection, sql):
    cursor = connection.cursor()
    cursor.execute(sql)
    rows = cursor.fetchall()
    columns = [d[0] for d in cursor.description]
    df = pd.DataFrame(rows, columns=columns)
    return df

In [3]:
uri = 'postgres://ulxm2fbyf5goeugr:u9OXxlZ87IszOyJZDUBysYxSkd5MjyYD@127.0.0.1:7080/rdsbroker_723069ee_da4e_4005_91bb_05ae87d4c572'
connection = psycopg2.connect(uri)

### datahub_company_id to companies_house_company_number

In [4]:
sql = ''' 
select 
  company_number as companies_house_company_number,
  id as datahub_company_id
  
from company_company

where company_number is not null and company_number != ''

order by 1

'''

df = query_database(connection, sql)
df.head()

  companies_house_company_number                    datahub_company_id
0                       00000950  9ed6709d-a098-e211-a939-e4115bead28a
1                       00009433  586e23d9-a098-e211-a939-e4115bead28a
2                       00009635  614d7997-a098-e211-a939-e4115bead28a
3                       00014259  13e260a9-a098-e211-a939-e4115bead28a
4                       00015993  de5659af-a098-e211-a939-e4115bead28a

### export country by company_house_number

In [5]:
sql = '''
select distinct
  company_number as companies_house_company_number,
  country_id,
  'datahub_export_country' as source
  
from company_company_export_to_countries l join company_company r on l.company_id = r.id

where company_number is not null
  and company_number != ''

order by 1

'''

df = query_database(connection, sql)
df.head()

,companies_house_company_number,country_id,source
0,08840722,945f66a0-5d95-e211-a939-e4115bead28a,datahub_export_country
1,08840722,a05f66a0-5d95-e211-a939-e4115bead28a,datahub_export_country
2,99919,35afd8d0-5d95-e211-a939-e4115bead28a,datahub_export_country
3,99919,36afd8d0-5d95-e211-a939-e4115bead28a,datahub_export_country

### countries of interest by company_house_number

In [6]:
sql = '''
with omis_countries_of_interest as (
    select distinct
      company_number as companies_house_company_number,
      primary_market_id as country_id,
      'datahub_order' as source,
      l.created_on as timestamp

    from order_order l join company_company r on l.company_id=r.id
    
    where company_number is not null

), datahub_countries_of_interest as (
    select distinct
      company_number as companies_house_company_number,
      country_id,
      'datahub_future_interest' as source,
      null::timestamp as timestamp

    from company_company_future_interest_countries l join company_company r on l.company_id=r.id
    
    where company_number is not null
    
), combined_countries_of_interest as (
  select * from omis_countries_of_interest
  
  union
  
  select * from datahub_countries_of_interest
  
)

select distinct
  companies_house_company_number,
  country_id,
  source,
  timestamp
  
from combined_countries_of_interest

order by 1
'''

df = query_database(connection, sql)
df.head()

,companies_house_company_number,country_id,source,timestamp
0,07702698,87756b9a-5d95-e211-a939-e4115bead28a,datahub_order,2019-09-10 12:23:47.161509+00:00
1,08840722,9e5f66a0-5d95-e211-a939-e4115bead28a,datahub_future_interest,NaT
2,10554118,9c5f66a0-5d95-e211-a939-e4115bead28a,datahub_order,2018-03-21 16:24:22.755638+00:00
3,99919,37afd8d0-5d95-e211-a939-e4115bead28a,datahub_future_interest,NaT

### countries and sectors of interest by company_house_number

there are two sources of sector, an order can have a sector associated to it and so can a company

In [7]:
sql = '''
select distinct
  company_number as companies_house_company_number,
  primary_market_id as country_id,
  l.sector_id,
  concat('datahub_order:', l.id) as source,
  l.created_on as timestamp
  

from order_order l join company_company r on l.company_id=r.id

where company_number is not null
  and company_number != ''

order by 1
'''

df = query_database(connection, sql)
df

,companies_house_company_number,country_id,sector_id,source,timestamp
0,07702698,87756b9a-5d95-e211-a939-e4115bead28a,af959812-6095-e211-a939-e4115bead28a,datahub_order:ff998328-43d3-4b9c-8db9-a21a0a9e...,2019-09-10 12:23:47.161509+00:00
1,10554118,9c5f66a0-5d95-e211-a939-e4115bead28a,9538cecc-5f95-e211-a939-e4115bead28a,datahub_order:b8a21be9-1320-47a0-8872-460967ee...,2018-03-21 16:24:22.755638+00:00

### sector of interest by company_house_number

In [8]:
sql = '''
with datahub as (
    select distinct
      company_number as companies_house_company_number,
      l.sector_id,
      'datahub_order' as source

    from order_order l join company_company r on l.company_id=r.id

    where company_number is not null
      and company_number != ''
      and l.sector_id is not null

), companies_house as (
    select distinct
        company_number as companies_house_company_number,
        sector_id,
        'companies_house_sic_code' as source
        
    from company_company
    
    where company_number is not null
        and company_number != ''
        and sector_id is not null
        
)

select * from datahub union all select * from companies_house

order by 1

'''

df = query_database(connection, sql)
df.head()

,companies_house_company_number,sector_id,source
0,00000950,a4e61afa-5f95-e211-a939-e4115bead28a,companies_house_sic_code
1,00009433,a522c9d2-5f95-e211-a939-e4115bead28a,companies_house_sic_code
2,00009635,355f977b-8ac3-e211-a646-e4115bead28a,companies_house_sic_code
3,00014259,355f977b-8ac3-e211-a646-e4115bead28a,companies_house_sic_code
4,00015993,355f977b-8ac3-e211-a646-e4115bead28a,companies_house_sic_code

### populate test database: `datahub_company_id_to_companies_house_company_number`

In [9]:
connection_2 = psycopg2.connect('postgres://countries_of_interest_service@localhost/countries_of_interest_service')
connection_2

In [10]:
sql = ''' drop table if exists datahub_company_id_to_companies_house_company_number '''
cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [11]:
sql = '''
create table if not exists datahub_company_id_to_companies_house_company_number (datahub_company_id uuid primary key, companies_house_company_number varchar(12))
'''
cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [12]:
sql = '''
select * from datahub_company_id_to_companies_house_company_number
'''
df = query_database(connection_2, sql)
df.head()

Empty DataFrame
Columns: [datahub_company_id, companies_house_company_number]
Index: []

In [13]:
sql = ''' 
select 
  company_number as companies_house_company_number,
  id as datahub_company_id
  
from company_company

where company_number is not null and company_number != ''

order by 1

'''

df = query_database(connection, sql)
df.head()

sql = '''
insert into datahub_company_id_to_companies_house_company_number values 
'''
for i, values in enumerate(df.get_values()):
    company_id, datahub_id = values
    sql += "\n\t('{}', '{}')".format(datahub_id, company_id)
    sql += ', ' if i != len(df) - 1 else ''
    
sql += '\n\ton conflict do nothing'

cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [14]:
sql = '''
select * from datahub_company_id_to_companies_house_company_number
'''
df = query_database(connection_2, sql)
df.head()

                     datahub_company_id companies_house_company_number
0  9ed6709d-a098-e211-a939-e4115bead28a                       00000950
1  586e23d9-a098-e211-a939-e4115bead28a                       00009433
2  614d7997-a098-e211-a939-e4115bead28a                       00009635
3  13e260a9-a098-e211-a939-e4115bead28a                       00014259
4  de5659af-a098-e211-a939-e4115bead28a                       00015993

### populate test database: `export_countries_by_companies_house_company_number`

In [15]:
connection_2 = psycopg2.connect('postgres://countries_of_interest_service@localhost/countries_of_interest_service')
connection_2

In [16]:
sql = ''' drop table if exists export_countries_by_companies_house_company_number '''
cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [17]:
sql = '''
create table if not exists export_countries_by_companies_house_company_number (
    companies_house_company_number varchar(12) not null, 
    export_country_id uuid not null, 
    source varchar(50) not null, 
    primary key (
        companies_house_company_number, 
        export_country_id, 
        source
    )
)
'''
cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [18]:
sql = '''
select * from export_countries_by_companies_house_company_number
'''
df = query_database(connection_2, sql)
df.head()

Empty DataFrame
Columns: [companies_house_company_number, export_country_id, source]
Index: []

In [19]:
sql = '''
select distinct
  company_number as companies_house_company_number,
  country_id,
  'datahub_export_country' as source
  
from company_company_export_to_countries l join company_company r on l.company_id = r.id

where company_number is not null
  and company_number != ''

order by 1

'''

df = query_database(connection, sql)
df.head()

sql = '''
insert into export_countries_by_companies_house_company_number values 
'''
for i, values in enumerate(df.get_values()):
    sql += "\n\t({})".format(', '.join(["'{}'".format(v) for v in values]))
    sql += ', ' if i != len(df) - 1 else ''
    
sql += '\n\ton conflict do nothing'

cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [20]:
sql = '''
select * from export_countries_by_companies_house_company_number
'''
df = query_database(connection_2, sql)
df.head()

,companies_house_company_number,export_country_id,source
0,08840722,945f66a0-5d95-e211-a939-e4115bead28a,datahub_export_country
1,08840722,a05f66a0-5d95-e211-a939-e4115bead28a,datahub_export_country
2,99919,35afd8d0-5d95-e211-a939-e4115bead28a,datahub_export_country
3,99919,36afd8d0-5d95-e211-a939-e4115bead28a,datahub_export_country

### populate test database: `countries_of_interest_by_companies_house_company_number`

In [21]:
connection_2 = psycopg2.connect('postgres://countries_of_interest_service@localhost/countries_of_interest_service')
connection_2

In [22]:
sql = ''' drop table if exists countries_of_interest_by_companies_house_company_number '''
cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [23]:
sql = '''
create table if not exists countries_of_interest_by_companies_house_company_number (
    companies_house_company_number varchar(12), 
    country_of_interest_id uuid, 
    source varchar(50), 
    timestamp timestamp,
    primary key (companies_house_company_number, country_of_interest_id, source)
)
'''
cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [24]:
sql = '''
select * from countries_of_interest_by_companies_house_company_number
'''
df = query_database(connection_2, sql)
df.head()

Empty DataFrame
Columns: [companies_house_company_number, country_of_interest_id, source, timestamp]
Index: []

In [25]:
sql = '''
with omis_countries_of_interest as (
    select distinct
      company_number as companies_house_company_number,
      primary_market_id as country_id,
      concat('datahub_order', ':', l.id) as source,
      l.created_on as timestamp

    from order_order l join company_company r on l.company_id=r.id
    
    where company_number is not null

), datahub_countries_of_interest as (
    select distinct
      company_number as companies_house_company_number,
      country_id,
      'datahub_future_interest' as source,
      null::timestamp as timestamp

    from company_company_future_interest_countries l join company_company r on l.company_id=r.id
    
    where company_number is not null
    
), combined_countries_of_interest as (
  select * from omis_countries_of_interest
  
  union
  
  select * from datahub_countries_of_interest
  
)

select distinct
  companies_house_company_number,
  country_id,
  source,
  timestamp
  
from combined_countries_of_interest

order by 1
'''

df = query_database(connection, sql)
df.head()

sql = '''
insert into countries_of_interest_by_companies_house_company_number values 
'''

for i, values in enumerate(df.get_values()):
    values = [
        "'{}'".format(values[0]), 
        "'{}'".format(values[1]), 
        "'{}'".format(values[2]), 
        "'{}'".format(values[3]) if pd.notnull(values[3]) else 'Null'
    ]
    sql += "\n\t({}, {}, {}, {})".format(*values)
    sql += ', ' if i != len(df) - 1 else ''
    
sql += '\n\ton conflict do nothing'

cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [26]:
sql = '''
select * from countries_of_interest_by_companies_house_company_number
'''
df = query_database(connection_2, sql)
df.head()

,companies_house_company_number,country_of_interest_id,source,timestamp
0,07702698,87756b9a-5d95-e211-a939-e4115bead28a,datahub_order:ff998328-43d3-4b9c-8db9-a21a0a9e...,2019-09-10 12:23:47.161509
1,08840722,9e5f66a0-5d95-e211-a939-e4115bead28a,datahub_future_interest,NaT
2,10554118,9c5f66a0-5d95-e211-a939-e4115bead28a,datahub_order:b8a21be9-1320-47a0-8872-460967ee...,2018-03-21 16:24:22.755638
3,99919,37afd8d0-5d95-e211-a939-e4115bead28a,datahub_future_interest,NaT

### populate test database: `countries_and_sector_of_interest_by_companies_house_company_number`

In [27]:
connection_2 = psycopg2.connect('postgres://countries_of_interest_service@localhost/countries_of_interest_service')
connection_2

In [28]:
sql = ''' drop table if exists countries_and_sectors_of_interest_by_companies_house_company_number '''
cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [29]:
sql = '''
create table if not exists countries_and_sectors_of_interest_by_companies_house_company_number (
    companies_house_company_number varchar(12), 
    country_of_interest_id uuid, 
    sector_of_interest_id uuid, 
    source varchar(50), 
    timestamp timestamp,
    primary key (companies_house_company_number, country_of_interest_id, source)
)
'''
cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [30]:
sql = '''
select * from countries_and_sectors_of_interest_by_companies_house_company_number
'''
df = query_database(connection_2, sql)
df.head()

Empty DataFrame
Columns: [companies_house_company_number, country_of_interest_id, sector_of_interest_id, source, timestamp]
Index: []

In [31]:
sql = '''
select distinct
  company_number as companies_house_company_number,
  primary_market_id as country_id,
  l.sector_id,
  concat('datahub_order:', l.id) as source,
  l.created_on as timestamp
  

from order_order l join company_company r on l.company_id=r.id

where company_number is not null
  and company_number != ''

order by 1
'''

df = query_database(connection, sql)
df

sql = '''
insert into countries_and_sectors_of_interest_by_companies_house_company_number values 
'''

for i, values in enumerate(df.get_values()):
    values = [
        "'{}'".format(values[0]), 
        "'{}'".format(values[1]), 
        "'{}'".format(values[2]), 
        "'{}'".format(values[3]), 
        "'{}'".format(values[4]) if pd.notnull(values[3]) else 'Null'
    ]
    sql += "\n\t({}, {}, {}, {}, {})".format(*values)
    sql += ', ' if i != len(df) - 1 else ''
    
sql += '\n\ton conflict do nothing'

cursor_2 = connection_2.cursor()
cursor_2.execute(sql)
connection_2.commit()

In [32]:
sql = '''
select * from countries_and_sectors_of_interest_by_companies_house_company_number
'''
df = query_database(connection_2, sql)
df.head()

,companies_house_company_number,country_of_interest_id,sector_of_interest_id,source,timestamp
0,07702698,87756b9a-5d95-e211-a939-e4115bead28a,af959812-6095-e211-a939-e4115bead28a,datahub_order:ff998328-43d3-4b9c-8db9-a21a0a9e...,2019-09-10 12:23:47.161509
1,10554118,9c5f66a0-5d95-e211-a939-e4115bead28a,9538cecc-5f95-e211-a939-e4115bead28a,datahub_order:b8a21be9-1320-47a0-8872-460967ee...,2018-03-21 16:24:22.755638